{"formsofsecurity": "4-21. The five forms of security tasks are screen, guard, cover, area security, and local security. Scout platoons conduct guard and cover as part of a larger force. The paragraphs below discuss each task. (Refer to FM 3-98 for more information.)", "formsofrecon": "3-48. The four forms of reconnaissance scout platoons conduct are zone, area, route, and reconnaissance in force. Special forces conduct the fifth form, special reconnaisance.", "screen": "4-22. A screen is a security task that scout platoons conduct to provide early warning to the protected force and report information related to a commander’s PIR. Within its Security capabilities and based upon the higher commander’s guidance, the scout platoon conducts counterreconnaissance to destroy or repel enemy reconnaissance forces. Screen tasks are defensive in nature and prevent enemy observation of the protected force. Scout platoons conduct screens to the front, flanks, or rear of a stationary friendly force, and to the flanks or rear of a moving friendly force. Scout platoons do not conduct screening missions forward of a moving friendly force.", "guard": "4-99. Guard is a security task to protect the main body by fighting to gain time while also observing and reporting information and preventing enemy ground observation of and direct fire against the main body. Units conducting a guard mission cannot operate independently because they rely upon fires and functional and multifunctional support assets of the main body. BCT commanders might assign a guard mission when they expect contact or has an exposed flank that requires greater protection than a screen can provide. The guard force conducts reconnaissance, attacks, defends, and delays as necessary to provide reaction time and maneuver space to the protected force. There are three types of guard missions: advance guard, flank guard, and rear guard. Additionally, a commander may assign a guard mission to protect a stationary or moving force. (Refer to FM 3-98 and ATP 3-20.97 for greater detail on guard missions).", "cover": "4-101. Cover is a security task that is a self-contained force that is capable of operating independently of the main body to allow early development of the situation, deceive, disorganize, and destroy enemy forces. The covering force protects the main body by fighting to gain time while also observing and reporting information and preventing enemy ground observation of and direct fires against the main body. The key distinction to remember is unlike the screen or guard, cover is tactically self-contained, meaning, because the covering force or portions of it often engage with enemy forces, it must have substantial combat power and sustainment resources to engage the enemy and still accomplish its mission. In addition, a covering force accomplishes all the tasks of screen or guard. Cover force is generally conducted by a reinforced BCT-sized element. (Refer to FM 3-98 for a better understanding of cover.)", "area": "3-65. An area reconnaissance is a form of reconnaissance that focuses on obtaining detailed information about the terrain, enemy, or civilian population within a prescribed area. For a scout platoon, a prescribed area may encompass one or a combination of these factors. For example, a scout platoon may deploy to a prescribed area such as a town to gather information about the population, roads, bridges, market places, and other society and infrastructure. Area reconnaissance is often employed during a zone reconnaissance for small towns, dead zones, and NAIs. The primary difference that identifies an area reconnaissance is the reduced size of the area boundaries compared to a zone. Additionally, whereas in a zone reconnaissance, the scout platoon focuses on the entirety of their assigned zone, from the LD to the LOA, in an area reconnaissance, the scout platoon may not be responsible for conducting reconnaissance during their movement to their assigned area. The commander may dictate that the reconnaissance begins once the platoon reaches their assigned reconnaissance area, or NAI associated with the tasked area reconnaissance, conducts a SLLS halt, and begins their reconnaissance.", "local": "4-116. Local security consists of observation posts, local security patrols, perimeter security, and other measures to provide close-in security for a force. This is an important part of maintaining the initiative. The requirement for maintaining local security is inherent in all missions. The scout platoon may support local security as part of a larger unit or maintain local security independently away from friendly elements. In some cases, it maintains its own assembly area and local security within the larger unit’s footprint. Local security includes all measures taken to prevent surprise by the enemy, Security including missions against the platoon’s location. It involves avoiding detection by the enemy or deceiving the enemy about friendly positions and intentions.", "zone": "3-49. Zone reconnaissance is the directed effort to obtain detailed information concerning enemy, terrain, or civil considerations, in accordance with the commander’s intent. Scout platoons conduct a zone reconnaissance within a location delineated by LD, lateral boundaries, and a limit of advance (LOA).", "route": "3-77. A route reconnaissance is a directed effort to obtain detailed information of a specified route and all terrain from which the enemy could influence movement along that route. A scout platoon conducts a route reconnaissance to answer questions for the commander about the presence and disposition of obstacles and enemy along a route and whether it will support the movement of friendly vehicles.", "reconinforce": "3-114. A reconnaissance in force is a squadron-level mission. Reconnaissance in force is an aggressive reconnaissance which develops information and intelligence in contact with the enemy to determine and exploit enemy weaknesses. The scout platoon usually conducts zone or an attack in support of the unit conducting the reconnaissance in force mission. (Refer to ATP 3-20.96 for more information on a reconnaissance in force). Tasks for reconnaissance in force include—  Penetrate the enemy’s security area and determine its size and depth.  Determine the location and disposition of enemy forces.  Attack enemy positions and attempt to force the enemy to react by using local reserves or major counterattack forces, employing fires, adjusting positions, and employing specific weapon systems.  Determine weaknesses in the enemy’s disposition for exploitation.  Locate obstacles and create lanes as specified.  Entering AOs in complex terrain not previously occupied by friendly forces, such as urban environments.", "specialrecon": "3-115. Special reconnaissance  is reconnaissance and surveillance actions conducted as a special operation in hostile, denied, or politically sensitive environments to collect or verify information of strategic or operational significance, employing military capabilities not normally found in conventional forces (JP 3-05).", "rho": "3-116. RHO is the process of planning, preparing, and executing transfer of responsibility and information from one element to another to facilitate continued observation or surveillance of enemy contact or an assigned area. The term element refers to all echelons involved in the RHO, from observation posts to squadron and battalion-sized components. Scout platoons can be the transferring element, the receiving element, or provide command and control for the RHO.", "passageoflines": "3-133. Passage of lines is an operation in which a force moves forward or rearward through another force’s combat positions with the intention of moving into or out of contact with the enemy. Designate passages as a FPOL or RPOL. Passage of lines is inherently a high risk activity that requires detailed planning, rehearsals, and communication to mitigate risk to friendly forces and operational tempo.", "didea": "4-161.  Direct fire weapons, platforms, squads, and small units incorporate the principles of combat identification into the direct fire engagement process. The DIDEA process provides an iterative, standardized, and systematic approach to target engagement activities with direct fire.  Detect. The target detection process takes practice and skill to acquire potential threats successfully in various environments and visibility conditions. This process includes all actions to actively search, acquire, and locate potential targets.  Identify. Once a potential threat is detected and acquired, the firer accurately identifies the range to target, and effectively establishes the threat as friend, foe, or neutral. Target identification is systematic process supporting the characterization of detected objects. Once identified as a hostile threat, crews classify the threat as most dangerous, dangerous, or least dangerous from their perspective.  Decide. The determination is made by the crew to engage or not. Soldiers and leaders use all the situational information at their disposal to ensure an appropriate level of response to the threat.  Engage. Engage is the specific application of military options or weapons to defeat, neutralize, or destroy the threat. Successful implementation of the weapons or military options at the disposal of the firer efficiently and effectively alters, disrupts, or halts the threat’s DIDEA process, and ultimately eliminates the threat to friendly force.  Assess. This step evaluates the weapons or options employed to defeat the threat or threats. It is the process the crew uses to determine if the applied weapons or options deliver the desired effect. Basic Scout Skills Scouts must master basic scout skills that they incorporate, both individually and collectively, into all reconnaissance and security missions. These skills are requisite in all scouts regardless of rank. Scouts have to perform reconnaissance and security in a dangerous and unknown environment, which requires these basic skills to be automatically understood and executed. Contents Page SECTION I. Fundamentals of Tactical Movement 5-1 SECTION II. Navigation 5-5 SECTION III. Mounted Scout Platoon Formations 5-11 SECTION IV. Movement Techniques 5-19 SECTION V. Dismounted Operations 5-24 SECTION VI. Actions on Contact 5-48 SECTION VII. Chemical, Biological, Radiological and Nuclear  Operations 5-69", "dangerareas": "5-44. During the execution of reconnaissance and security, the platoon encounters specific types of terrain features or regions that expose them to enemy fire. These danger areas are likely points of enemy cont act due to the scout platoon’s inherent vulnerabilities while navigating. Identify and highlight enemy cover, concealment, and observation danger areas when the platoon leader performs map reconnaissance and platoon analysis during TLP. There is no perfect way to counter every danger area so leaders at all levels need to use disciplined initiative when reacting to danger areas. Examples of danger areas include—  Open areas.  Wooded areas.  Roads, trails, and rail lines.  Urban areas.  Minefields and obstacles.  Streams."}